app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY created_at DESC
---
	def index
		@posts=Post.all.order('created_at DESC')

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
	def create
		@post=Post.new(post_params)

		if @post.save

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Validated "], ["updated_at", "2019-06-27 07:08:10.840772"], ["id", 2]]
---
	def update
		@post=Post.find(params[:id])

		if @post.update(params[:post].permit(:title, :body))

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
	def destroy
		@post=Post.find(params[:id])
		@post.destroy